##Як контрольний приклад створити файл v10.txt, який складається з
##трьох речень, та продемонструвати на ньому виконання завдання.
##Зчитати файл «10.txt» та перетворити його у файл «101.txt», який
##складається з речень, що мають непарну кількість букв, та у файл
##«102.txt», що містить слова, у яких більше ніж три голосні букви.
##Зберегти цей файл у кодуванні UTF-8.
import shutil
import os
text = '''Python - інтерпретована об'єктно-орієнтована мова програмування високого рівня зі строгою динамічною типізацією.
Розроблена в 1990 році Гвідо ван Россумом.
Структури даних високого рівня разом із динамічною семантикою та динамічним зв'язуванням роблять її привабливою для швидкої розробки програм, а також як засіб поєднування наявних компонентів.
Python підтримує модулі та пакети модулів, що сприяє модульності та повторному використанню коду.
Інтерпретатор Python та стандартні бібліотеки доступні як у скомпільованій, так і у вихідній формі на всіх основних платформах.
В мові програмування Python підтримується кілька парадигм програмування, зокрема: об'єктно-орієнтована, процедурна, функціональна та аспектно-орієнтована.
'''
def ddd(rech):
        alfavit =('А','а','Б','б','В','в','Г','г','Д','д','Е','е','Є','є','Ж','ж','З','з','и','І','і','Ї','ї','Й','й','К','к','Л','л','М','м','Н','н','О','о','П','п','Р','р','С','с','Т','т','У','у','Ф','ф','Х','х','Ц','ц','Ч','ч','Ш','ш','Щ','щ','ь','Ю','ю','Я','я')
        k=0
        for x in rech:
                if x in alfavit:
                    k+=1
        return k
##---------------------------------------------##
def ggg(slov):
        a=0
        golosni = ('А','а','Е','е','І','і','О','о','У','у','и')
        for y in slov:
                if y in golosni:
                        a+=1
        return a
##---------------------------------------------##
f = open('v10.txt', 'w', encoding='utf-8')
f.write(text)
f.close()
os.rename('v10.txt', '10.txt')
f = open ('10.txt', 'r',encoding='utf-8')
line = f.readlines()
f.close()
os.rename('10.txt', '101.txt')
##---------------------------------------------##
f = open('101.txt','w', encoding='utf-8')
word = text.split("\n")
for w in word:
        s=str(ddd(w))
        if ddd(w)%2 == 1:
                f.write(w + s + ' \n')
f.close()
##---------------------------------------------##
f = open('102.txt', 'w', encoding='utf-8')
list_word = text.split()
for word in list_word:
        a = ggg(word)
        if  a > 3:
                 f.write(word+' \n')                      
f.close()
