#Створення прикладних програм на мові Python, Лабораторна робота №5, Кульчицький Олег, №10
print ('Створення прикладних програм на мові Python, Лабораторна №5')
print ('Кульчицький Олег, №10')
num = input('Введіть шестизначне число: ')
a = []
if len(num) != 6:
	print('Неправильно ввели число!!!')
else:
	for x in num:
		a.append(int(x))
	if (a[0] + a[1] + a[2] == a[3] + a[4] + a[5]):
		print(a[0] + a[1] + a[2],' = ',  a[3] + a[4] + a[5],' - ЩАСЛИВЕ')
	else:
		print(a[0] + a[1] + a[2],' != ', a[3] + a[4] + a[5],' - НЕЩАСЛИВЕ')
